In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [21]:
df=pd.read_csv("Titanic.csv")
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [22]:
df.drop(["PassengerId","Name","SibSp","Ticket","Cabin","Embarked"],axis="columns")

     Survived  Pclass     Sex   Age  Parch     Fare
0           0       3    male  22.0      0   7.2500
1           1       1  female  38.0      0  71.2833
2           1       3  female  26.0      0   7.9250
3           1       1  female  35.0      0  53.1000
4           0       3    male  35.0      0   8.0500
..        ...     ...     ...   ...    ...      ...
886         0       2    male  27.0      0  13.0000
887         1       1  female  19.0      0  30.0000
888         0       3  female   NaN      2  23.4500
889         1       1    male  26.0      0  30.0000
890         0       3    male  32.0      0   7.7500

[891 rows x 6 columns]

In [0]:
inputs=df.drop('Survived',axis='columns')

In [0]:
target=df['Survived']

In [0]:
from sklearn.preprocessing import LabelEncoder
le_Sex=LabelEncoder()

In [0]:
inputs['Sex_n']=le_Sex.fit_transform(inputs['Sex'])

In [27]:
inputs

     PassengerId  Pclass  ... Embarked Sex_n
0              1       3  ...        S     1
1              2       1  ...        C     0
2              3       3  ...        S     0
3              4       1  ...        S     0
4              5       3  ...        S     1
..           ...     ...  ...      ...   ...
886          887       2  ...        S     1
887          888       1  ...        S     0
888          889       3  ...        S     0
889          890       1  ...        C     1
890          891       3  ...        Q     1

[891 rows x 12 columns]

In [0]:
inputs_n=inputs.drop(['Name','Sex','SibSp','Parch','Ticket','Cabin','Embarked','PassengerId'],axis='columns')

In [0]:
inputs_n.Age = inputs_n.Age.fillna(inputs_n.Age.mean())

In [42]:
inputs_n

     Pclass        Age     Fare  Sex_n
0         3  22.000000   7.2500      1
1         1  38.000000  71.2833      0
2         3  26.000000   7.9250      0
3         1  35.000000  53.1000      0
4         3  35.000000   8.0500      1
..      ...        ...      ...    ...
886       2  27.000000  13.0000      1
887       1  19.000000  30.0000      0
888       3  29.699118  23.4500      0
889       1  26.000000  30.0000      1
890       3  32.000000   7.7500      1

[891 rows x 4 columns]

In [43]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [0]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [46]:
model.fit(inputs_n,target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [47]:
model.score(inputs_n,target)

0.9797979797979798

In [53]:
model.predict([[2,22,40,1]])

array([0])